
# p 3 ------------------------------------------------------

while True:
    month = input("Введите номер месяца от 1 до 12:\n")
    if month.isdigit():
        month = int(month)
        if month > 0 and month <= 12:
            break
    print("Неверно")

list_season = ['зима', 'зима',
               'весна', 'весна', 'весна',
               'лето', 'лето', 'лето',
               'осень', 'осень', 'осень',
               'зима']
print('Первый способ:')
print(list_season[month-1])

dict_season = {12:"зима", 1:"зима", 2:"зима",
               3:"весна", 4:"весна", 5:"весна",
               6:"лето", 7:"лето", 8:"лето",
               9:"осень", 10:"осень", 11:"осень"}
print('Второй способ:')
print(dict_season.get(month))
